app/controllers/api/meals_controller.rb

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = 2 AND "meals"."eaten_on" = '2025-09-23' ORDER BY "meals"."kind" ASC, "meals"."created_at" ASC
---
  def index
    date = (params[:eaten_on].presence || Date.current).to_date
    meals = current_user.meals.where(eaten_on: date).order(:kind, :created_at)

INSERT INTO "meals" ("user_id", "eaten_on", "kind", "name", "amount_grams", "calories_kcal", "notes", "created_at", "updated_at") VALUES (2, '2025-09-22', 1, '45', 300, 500, '美味しかった。', '2025-09-22 15:11:06.847514', '2025-09-22 15:11:06.847514') RETURNING "id"
---
  def create
    meal = current_user.meals.new(meal_params)
    meal.eaten_on ||= Date.current
    if meal.save

UPDATE "meals" SET "kind" = 1, "amount_grams" = 102, "calories_kcal" = 21, "notes" = '納豆と一緒に食べた！！', "updated_at" = '2025-09-20 15:10:44.757454' WHERE "meals"."id" = 6
---
  def update
    if @meal.update(meal_params)

DELETE FROM "meals" WHERE "meals"."id" = 7
---
  def destroy
    @meal.destroy

SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = 2 AND "meals"."id" = 7 LIMIT 1
---
  def set_meal
    @meal = current_user.meals.find(params[:id])