app/controllers/api/sessions_controller.rb

    def create
      email = params[:email].to_s.strip.downcase
      user  = User.find_by("LOWER(email) = ?", email)
---
SELECT "users".* FROM "users" WHERE (LOWER(email) = 'alice@example.com') LIMIT 1