app/controllers/application_controller.rb

  def authenticate_user!
    token = request.headers['Authorization']&.split(' ')&.last
    return unauthorized! unless token
    # JWTデコードしてユーザーを特定
    payload, = JWT.decode(token, jwt_secret, true, algorithm: 'HS256')
    uid = payload['sub'] || payload['user_id'] || payload['uid']
    @current_user = User.find_by(id: uid)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1