app/controllers/users_controller.rb

  def create
    user = User.new(user_params)

    if user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "nickname") VALUES ('youo@example.com', '$2a$12$EfvL5QfnFWhOEMslyP7b3.FZTX63Dzv4x4OggscRZkzGPBgtmDPAS', '2025-09-19 16:44:20.270465', '2025-09-19 16:44:20.270465', 'kimi') RETURNING "id"